{
    "devkitpro": "DevkiPro is an extremely helpful pack of tools used for compiling and making C injections in GBA. Compiling CFRU but getting bugs with DNS, ability pops, warning Load segment with RWX permissions? Just replace your devkitPro folder completely with this. (Unzip it first)\n https://www.mediafire.com/file/br2xpo14rd2a76c/devkitPro.zip/file \nDo this again if the warnings or errors continue!",
    "installation": "Here are the installation instructions for inserting CFRU.\nhttps://github.com/Skeli789/Complete-Fire-Red-Upgrade/wiki/Windows-Installation-Instructions\nThey work for DPE in the same way.\nIf you have done these instructions and compiled CFRU, every time you want to compile CFRU and DPE just use right click of mouse + shift > open powershell window here and write ```python scripts//make.py```",
    "server": "This server is a haven for all kinds of programmers. We support every kind of rom hacking and we encourage to develop them more in programming skills. Probably a place to hang out as a programmer or a new game mechanics fan.",
    "cfruex": "The CFRU expansion is a publicly open project based on Skeli's Complete Fire Red Upgrade engine for Fire red binary with large-scale modifications and improvements and decomps features. DPE gen 9 is a subset of Skeli's Dynamic Pokemon Expansion expanding pokemon and dex till gen 9.\nRead more here!\nhttps://github.com/Shiny-Miner/CFRU-expansion/blob/Experiments/README.md",
    "scade": "SCADE is my name. Sir Shiny has made me to change the world, ok? Oh I forgot it was also the rombase name which is developed for testing purposes of CFRU expansion. Really kind and clever isn't it? You can easily find that rom base in Hex maniac server, I don't know but why Sir Shiny keeps it limited to that server, xD maybe cause all binary hackers are a part of it.",
    "decomps": "Decomps? Yeh I've heard it. Probably it refers to pokefirered and pokeemerald. Actualy they're the real creation of the source code of Pokemon Fire Red and Pokemon Emerald made with C programming. Can you imagine Gamefreak did that in 2004? What it all means it using decomps we can make changes in the whole source code and as it generates a rom itself , the new rom will have the different offsets than vanilla one as it really a dynamic change or you can say your modification is now a part of the code instead what we do in binary is repointing/changing pointers to point to the new space, no body cares about the garbage old data which is  still there but not being used. While in decomps instead of repointing to a different data we're modifiying the old data and based on its space the offsets change. You can really do mapping, scripting, graphics, overworld, tiles, music, pokemon changes in that CODE FOR REAL!"

}
